Repository: Azzam1503/training
Catalog: _locales/*/LC_MESSAGES/deployment_sites.po
Languages: es

source: Buildout II: Getting ready for deployment
es: Buildout - Parte II: Cómo prepararse para el despliegue

source: The starzel-buildout
es: El buildout de starzel

source: Have a look at the buildout we use for our projects: https://github.com/starzel/buildout
es: Miremos la configuración buildout que usaremos para nuestros proyectos: https://github.com/starzel/buildout

source: It has some noteable features:
es: Tiene algunas características notables:

source: It extends to files on github shared by all projects of the same version
es: Se extiende a archivos en github por todos los proyectos de la misma versión

source: Minimal work to setup a new project
es: Trabajo mínimo para instalar un nuevo proyecto

source: Presets for development, testing, staging and production
es: Preestablecidos para desarrollo, pruebas, implantación y producción

source: A deployment-setup
es: Una instalacion de despliegue

source: zeoserver and zeoclients
es: zeoserver y zeoclients

source: monitoring
es: monitoreo

source: backup
es: respaldo

source: precompiler
es: precompilador

source: cronjobs
es: tareas crontab (cronjobs)

source: Other tools we use
es: Otras herramientas a usar

source: Fabric (manage sites)
es: Fabric (administra sitios)

source: Sentry (error-monitoring)
es: Sentry (monitoreo de errores)

source: Ansible (manage and setup servers and tools)
es: Ansible (Administra e instala servidores y herramientas)

source: Nagios (server-monitoring)
es: Nagios (monitoreo de servidores)

source: jenkins (tests)
es: Jenkins (pruebas continuas de software)

source: piwik (statictics)
es: Piwik (estadísticas)

source: gitlab (code-repo and code-review)
es: Gitlab (repositorio y revisión de código)

source: redmine (ticket-system and wiki)
es: Redmine (sistema de ticket y wiki)
